app/Http/Controllers/HomeController.php

select `id`, `name`, `email`, `phone`, `address`, `job`, `degree`, `profile_pic`, `birth_day`, `experience` from `users` where `id` = 1 limit 1
select * from `qualifications` where `type` = 'Work' order by `id` desc limit 3
select * from `qualifications` where `type` = 'Education' order by `id` desc limit 3
select * from `skills` order by `id` desc limit 6
select * from `services` limit 6
select * from `categories`
select * from `reviews` order by `id` desc limit 5
select * from `categories` where `categories`.`id` in (1, 2)
select * from `portfolios` order by `id` desc limit 6
select * from `settings` limit 1
---
    public function index()
    {
        $user = User::select(
            'id',
            'name',
            'email',
            'phone',
            'address',
            'job',
            'degree',
            'profile_pic',
            'birth_day',
            'experience')->where('id',1)->first();

        $experiences = Qualification::where('type',['Work'])->orderBy('id', 'desc')->take(3)->get();
        $educations = Qualification::where('type',['Education'])->orderBy('id', 'desc')->take(3)->get();

        $skills = Skill::orderBy('id', 'desc')->take(6)->get();

        $services = Service::take(6)->get();

        $categories = Category::all();
        $reviewers = Review::orderBy('id', 'desc')->take(5)->get();

        $portfolios= Portfolio::with('category')->orderBy('id', 'desc')->take(6)->get();

        $setting = Setting::first();