app/Http/Controllers/Admin/ServiceController.php

select * from `services`
---
    public function index()
    {
        $services = Service::all();